Data frames are 2d data structures .
Data is aligned in a tabular format consists of rows and columns
DataFrames can hold multiple data types
DataFrames Constructor in pandas is
pd.DataFrames(data=,index=,dtype=,copy)
data holds the data source
index holds the index to access the data source
dtype is type of the data
copy is self to false default. take a copy

In [1]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [3]:
np.random.seed(101)      #### we get the same set of random numbers

In [8]:
#### creating a data frame using random number generator randn,use shift + tab to understand more about data frame parameters

df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [7]:
df

#### each of the column W,X,Y,Z is each a pandas series sharing a common index

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
#### creating a data frame from a list
df_list = [['a1','b1','c1'],['a2','b2','c2'],['a3','b3','c3']]
df_list

#### to create user defined index, let us create a list of index
df_index = ['indx1','indx2','indx3']

In [11]:
### create dataframe from list
#data_Frame_list = pd.DataFrame(data=df_list)

data_Frame_list = pd.DataFrame(data=df_list,index=df_index,columns=('ColA','ColB','Colc'))
data_Frame_list

      ColA ColB Colc
indx1   a1   b1   c1
indx2   a2   b2   c2
indx3   a3   b3   c3

In [12]:
#### creating a dataframe from dictionary
#### let us create a new diction
df_dict = {'k1':(1,2,3),'k2':(20,30,40),'k3':(30,40,50),'k4':[100,200,300]}


### to make INDEXES FOR DATAFRAME
#data_Frame_dict = pd.DataFrame(data=df_dict,index=('I1','I2','I3','I4'),columns=('ColA','ColB','ColC','ColD'))
#data_Frame_dict


### to make INDEXES FOR DATAFRAME
#data_Frame_dict = pd.DataFrame(data=df_dict,index=('k1','k2','k3','k4'),columns=('ColA','ColB','ColC','ColD'))
#data_Frame_dict

In [15]:
### default creation
data_Frame_dict = pd.DataFrame(data=df_dict)
print(data_Frame_dict)

   k1  k2  k3   k4
0   1  20  30  100
1   2  30  40  200
2   3  40  50  300

In [16]:
pd.Series(data=df_dict)

k1          (1, 2, 3)
k2       (20, 30, 40)
k3       (30, 40, 50)
k4    [100, 200, 300]
dtype: object

In [18]:
### retreiving /accessing/grabbing/extracting data from a dataframe

In [17]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [20]:
#### to retrieve information from data frame
df['W']

#### note that the output is a series

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [21]:
type(df['W'])

pandas.core.series.Series

In [23]:
### alternate way to retrieve data from df. THIS IS NOT RECOMMENDED 
### because using '.' can get confused with 
#### using methods
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [25]:
#### To retrieve multiple columns ..note the twin square brackets
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [27]:
df[['W','Z','X']]

#### Double bracket notation is enough to extract columns

          W         Z         X
A  0.302665 -1.159119  1.693723
B -0.134841  0.184502  0.390528
C  0.807706  0.329646  0.072960
D -0.497104  0.484752 -0.754070
E -0.116773  1.996652  1.901755

In [28]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
#### creating a new column  - helps in feature creation
### df['new']   returns error that new column is not found

#### correct way of creating a new column or feature

df['new1']  = df['W'] + df['Y']

In [35]:
df

          W         X         Y         Z      new1
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [37]:
#### to remove columns from a data frame
df.drop('new1')   #### you will get an error "labels new not contained in axis

KeyError: "labels ['new1'] not contained in axis"

data has 2 axis values

axis =0  represents a row in a dataframe
axis=1   represents a column in a dataframe

when no axis is given , axis=0 is assumed

- when we try to

In [39]:
df.drop('new1',axis=1)   
#### axis= 0 for drop method refers to index ('A','B')
#### axis=1  refer to columns W, X, Y,Z, new

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [41]:
df
###observe that new1 is not permanently dropped

          W         X         Y         Z      new1
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [42]:
#### for hard deleting or dropping. inplace argument is needed 
df.drop('new1',axis=1,inplace=True)

In [49]:
df       ##### notice new column is permanently removed

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [69]:
df1 = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns= ['W','X','Y','Z'])

In [59]:
df2 = df = pd.DataFrame(data=randn(5,4),index=['H','I','J','K','L'],columns= ['M','N','O','P'])

In [60]:
df2

          M         N         O         P
H  0.586847 -1.621348  0.677535  0.026105
I -1.678284  0.333973 -0.532471  2.117727
J  0.197524  2.302987  0.729024 -0.863091
K  0.305632  0.243178  0.864165 -1.560931
L -0.251897 -0.578120  0.236996  0.200780

In [61]:
#### dropping rows

df2.drop('L')

          M         N         O         P
H  0.586847 -1.621348  0.677535  0.026105
I -1.678284  0.333973 -0.532471  2.117727
J  0.197524  2.302987  0.729024 -0.863091
K  0.305632  0.243178  0.864165 -1.560931

In [62]:
df2  ####  (no hard delete with rows as well)

          M         N         O         P
H  0.586847 -1.621348  0.677535  0.026105
I -1.678284  0.333973 -0.532471  2.117727
J  0.197524  2.302987  0.729024 -0.863091
K  0.305632  0.243178  0.864165 -1.560931
L -0.251897 -0.578120  0.236996  0.200780

In [63]:
#### hard deleting rows using inplace
df2.drop('L',inplace=True)

In [64]:
df2        #### note row E is premanently deleted

          M         N         O         P
H  0.586847 -1.621348  0.677535  0.026105
I -1.678284  0.333973 -0.532471  2.117727
J  0.197524  2.302987  0.729024 -0.863091
K  0.305632  0.243178  0.864165 -1.560931

In [ ]:
#### why are rows having axis =0 and columns have axis=1
### this is because they are built off of numpy arrays

In [25]:
#### to establish the above

df.shape

### the output is a touple, where indexs or rows ar 4 and columns are 4 too. 
#### that is rows are referred to as 0 axis and columns are 1 axis

(5, 5)

In [70]:
df1

          W         X         Y         Z
A  0.327845  0.674485 -0.174057  0.780140
B -0.383258 -0.409318  0.343539  0.196275
C -0.982776  2.231555 -0.971393 -1.522333
D  1.133703  0.528187  0.393461 -0.630507
E -1.398290 -0.219311 -0.045676  0.012421

In [72]:
#### selecting rows, by using .loc method. .loc is followed by [] and not ()
df1.loc['C']
### note that the rows are reported as series as well

W   -0.982776
X    2.231555
Y   -0.971393
Z   -1.522333
Name: C, dtype: float64

In [75]:
df1.loc['C']

W   -0.982776
X    2.231555
Y   -0.971393
Z   -1.522333
Name: C, dtype: float64

In [77]:
#### index location based look up
df1.iloc[2]

W   -0.982776
X    2.231555
Y   -0.971393
Z   -1.522333
Name: C, dtype: float64

In [78]:
df1

          W         X         Y         Z
A  0.327845  0.674485 -0.174057  0.780140
B -0.383258 -0.409318  0.343539  0.196275
C -0.982776  2.231555 -0.971393 -1.522333
D  1.133703  0.528187  0.393461 -0.630507
E -1.398290 -0.219311 -0.045676  0.012421

In [32]:
#### to extract subset of rows and columns - example row B and Column Y

In [80]:
df1.loc['B','Y']

0.3435391865584499

In [82]:
#### SUBSETTING -Example 2 - extract values in row A and B, columns W and Y
df1.loc[['A','B'],['W','Y']]

          W         Y
A  0.327845 -0.174057
B -0.383258  0.343539

In [99]:
df1.iloc[0:2]

          W         X         Y         Z
A  0.327845  0.674485 -0.174057  0.780140
B -0.383258 -0.409318  0.343539  0.196275

In [100]:
df1

          W         X         Y         Z
A  0.327845  0.674485 -0.174057  0.780140
B -0.383258 -0.409318  0.343539  0.196275
C -0.982776  2.231555 -0.971393 -1.522333
D  1.133703  0.528187  0.393461 -0.630507
E -1.398290 -0.219311 -0.045676  0.012421

In [127]:
### adding rows into dataframe
rowadd_df= pd.DataFrame(data=randn(5,4),columns=['colA','colB','colC','colD'])
rowadd_df

       colA      colB      colC      colD
0 -1.409126  0.870907  1.585812  0.929658
1 -0.550876  0.942045 -0.975349 -1.054851
2  2.165421 -1.267240 -0.802843 -0.253479
3  0.090699  1.321715  0.794129  1.359712
4  0.771970  0.294217 -1.391519  0.147486

In [124]:
newrows=pd.DataFrame(data=([[100,200,300,400],[600,700,800,900]]),index=(5,6),columns=['colA','colB','colC','colD'])

In [125]:
newrows2=pd.DataFrame(data=([[100,200,300,400],[600,700,800,900]]),columns=['colA','colB','colC','colD'])

In [126]:
newrows2

   colA  colB  colC  colD
0   100   200   300   400
1   600   700   800   900

In [129]:
rowadd_df=rowadd_df.append(newrows2)
rowadd_df

         colA        colB        colC        colD
0   -1.409126    0.870907    1.585812    0.929658
1   -0.550876    0.942045   -0.975349   -1.054851
2    2.165421   -1.267240   -0.802843   -0.253479
3    0.090699    1.321715    0.794129    1.359712
4    0.771970    0.294217   -1.391519    0.147486
0  100.000000  200.000000  300.000000  400.000000
1  600.000000  700.000000  800.000000  900.000000
0  100.000000  200.000000  300.000000  400.000000
1  600.000000  700.000000  800.000000  900.000000

In [130]:
rowadd_df.loc[0]

         colA        colB        colC        colD
0   -1.409126    0.870907    1.585812    0.929658
0  100.000000  200.000000  300.000000  400.000000
0  100.000000  200.000000  300.000000  400.000000

In [120]:
### adding rows into dataframe
rowadd_df1 = pd.DataFrame(data=randn(5,4),columns=['colA','colB','colC','colD'])
rowadd_df1

       colA      colB      colC      colD
0 -0.298436  0.029141  0.889031 -1.839261
1  0.863596 -1.076591 -0.580383  1.209027
2  1.201744 -0.820463 -1.029577 -1.524856
3 -0.854860  1.602816  0.185479 -0.994018
4 -0.131906 -1.335092 -0.089298  0.698566

In [121]:
newrows1=pd.DataFrame(data=([[100,200,300,400],[600,700,800,900]]),index=(5,6),columns=['colE','colF','colG','colH'])

In [123]:
rowadd_df1=rowadd_df1.append(newrows1)
rowadd_df1

D:\anaconda\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

       colA      colB      colC      colD   colE   colF   colG   colH
0 -0.298436  0.029141  0.889031 -1.839261    NaN    NaN    NaN    NaN
1  0.863596 -1.076591 -0.580383  1.209027    NaN    NaN    NaN    NaN
2  1.201744 -0.820463 -1.029577 -1.524856    NaN    NaN    NaN    NaN
3 -0.854860  1.602816  0.185479 -0.994018    NaN    NaN    NaN    NaN
4 -0.131906 -1.335092 -0.089298  0.698566    NaN    NaN    NaN    NaN
5       NaN       NaN       NaN       NaN  100.0  200.0  300.0  400.0
6       NaN       NaN       NaN       NaN  600.0  700.0  800.0  900.0
5       NaN       NaN       NaN       NaN  100.0  200.0  300.0  400.0
6       NaN       NaN       NaN       NaN  600.0  700.0  800.0  900.0